 
 
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество; 
	Объект.ИтогСумма = Объект.Товары.Итог("Стоимость"); 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент) 
	ОчиститьСообщения(); 
	Элементы.Товары.ТекущиеДанные.Цена = РасчетыСервер.РасчетЦеныНоменклатуры(Объект.Дата, Элементы.Товары.ТекущиеДанные.Номенклатура);  
	Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество; 
	Объект.ИтогСумма = Объект.Товары.Итог("Стоимость"); 
	
	Если Элементы.Товары.ТекущиеДанные.Цена = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Цена Товара: " + Элементы.Товары.ТекущиеДанные.Номенклатура + " не установлена Прейскурантом цен." ;
		Сообщение.Поле = "Объект.Товары["+ ((Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока).НомерСтроки)-1) +"].Цена";  
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)  
	ОчиститьСообщения();
	Объект.ИтогСумма = Объект.Товары.Итог("Стоимость");
КонецПроцедуры

