
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	// регистр ТоварыНаСкладах Приход
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&МоментВремени,
		|			Номенклатура = &Номенклатура
		|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаТовары.Номенклатура);
		Запрос.УстановитьПараметр("Склад", Склад);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();	
		
		Если ТекСтрокаТовары.Количество > ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда  
			Отказ = Истина; 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Товара <" + ТекСтрокаТовары.Номенклатура + "> на складе <" + Склад + "> недостаточно. Недостаёт " + (ТекСтрокаТовары.Количество - ВыборкаДетальныеЗаписи.КоличествоОстаток) + " шт.";
			Сообщение.Сообщить();
		Иначе
			Движение = Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Стоимость = ТекСтрокаТовары.Стоимость;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры
