

Функция РасчетЦеныНоменклатуры(Дата, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныРеализацииСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныРеализации.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныРеализацииСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ЦенаНоменклатуры = 0;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		ЦенаНоменклатуры = ВыборкаДетальныеЗаписи.Цена; 
	КонецЕсли; 
	
	Возврат ЦенаНоменклатуры;	
	
КонецФункции 