

Функция РасчетЦеныНоменклатуры(Дата, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныРеализацииСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныРеализации.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныРеализацииСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура); 
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать(); 
	ВыборкаДетальныеЗаписи.Следующий();
	ЦенаНоменклатуры = ВыборкаДетальныеЗаписи.Цена; 
	Возврат ЦенаНоменклатуры;
	
КонецФункции 